// إعدادات الوظيفة الحالية (الاختصاصات المسموح لها بالتقديم)
const currentJobAllowedMajors = ["الهندسة الكيمياوية", "هندسة النفط"];

// قاعدة البيانات الوهمية
const mockDatabase = [
    { id: "JBS222742", name: "مؤمل خالد جوحي الفرطوسي", major: "الهندسة الكيمياوية", phone: "07818066390", uni: "جامعة بابل" },
    { id: "JBS100001", name: "علي حسين محمد", major: "هندسة النفط", phone: "07700000001", uni: "جامعة ميسان" },
    { id: "JBS100002", name: "أحمد جاسم كريم", major: "الهندسة المدنية", phone: "07700000002", uni: "جامعة البصرة" }, // تخصص مرفوض
    { id: "JBS100003", name: "مصطفى رعد هاشم", major: "الهندسة المعمارية", phone: "07800000003", uni: "جامعة بغداد" }, // تخصص مرفوض
    { id: "JBS100004", name: "زينب قاسم حسن", major: "الهندسة الكيمياوية", phone: "07700000004", uni: "جامعة التكنولوجية" },
    { id: "JBS100005", name: "حسين علي كاظم", major: "هندسة ميكانيك", phone: "07800000005", uni: "جامعة ميسان" }, // تخصص مرفوض
    { id: "JBS100006", name: "محمد باقر جابر", major: "هندسة النفط", phone: "07701111116", uni: "جامعة البصرة للنفط والغاز" },
    { id: "JBS100007", name: "نور ستار جليل", major: "علوم حاسبات", phone: "07801111117", uni: "جامعة ميسان" },
    { id: "JBS100008", name: "كرار حيدر سعد", major: "الهندسة الكيمياوية", phone: "07701111118", uni: "جامعة المثنى" },
    { id: "JBS100009", name: "سجاد عقيل نعمة", major: "هندسة كهرباء", phone: "07801111119", uni: "جامعة واسط" },
    { id: "JBS100010", name: "تبارك رحيم مطشر", major: "هندسة النفط", phone: "07702222220", uni: "جامعة بغداد" },
    { id: "JBS100011", name: "حسن هادي عباس", major: "ادارة واقتصاد", phone: "07802222221", uni: "جامعة ميسان" },
    { id: "JBS100012", name: "فاطمة حامد داخل", major: "الهندسة الكيمياوية", phone: "07702222222", uni: "جامعة تكريت" },
    { id: "JBS100013", name: "مرتضى صلاح مهدي", major: "هندسة بيئة", phone: "07802222223", uni: "جامعة بابل" },
    { id: "JBS100014", name: "غدير ماجد طاهر", major: "هندسة مواد", phone: "07703333334", uni: "جامعة الكوفة" },
    { id: "JBS100015", name: "علي الاكبر سعدون", major: "هندسة النفط", phone: "07803333335", uni: "جامعة ميسان" },
    { id: "JBS100016", name: "اسراء جبار وادي", major: "الهندسة الكيمياوية", phone: "07703333336", uni: "جامعة البصرة" },
    { id: "JBS100017", name: "منتظر وليد خالد", major: "قانون", phone: "07804444447", uni: "جامعة ميسان" },
    { id: "JBS100018", name: "رسل عصام حامد", major: "هندسة مدنية", phone: "07704444448", uni: "جامعة بابل" },
    { id: "JBS100019", name: "يوسف ناصر غالي", major: "الهندسة الكيمياوية", phone: "07804444449", uni: "جامعة القادسية" }
];
